[
  {
    "id": 1,
    "text": "المادة 1يطلق على هذا القانون اسم مدونة الأسرة، ويشار إليها بعده باسم المدونة."
  },
  {
    "id": 2,
    "text": "المادة 2تسري أحكام هذه المدونة على:1 - جميع المغاربة ولو كانوا حاملين لجنسية أخرى؛2 - اللاجئين بمن فيهم عديمو الجنسية، طبقا لاتفاقية جنيف المؤرخة ب 28 يوليوز لسنة 1951 المتعلقة بوضعية اللاجئين؛3 - العلاقات التي يكون فيها أحد الطرفين مغربيا؛4 - العلاقات التي تكون بين مغربيين أحدهما مسلم.أما اليهود المغاربة فتسري عليهم قواعد الأحوال الشخصية العبرية المغربية."
  },
  {
    "id": 3,
    "text": "المادة 3تعتبر النيابة العامة طرفا أصليا في جميع القضايا الرامية إلى تطبيق أحكام هذه المدونة."
  },
  {
    "id": 4,
    "text": "المادة 4الزواج ميثاق تراض وترابط شرعي بين رجل وامرأة على وجه الدوام، غايته الإحصان والعفاف وإنشاء أسرة مستقرة، برعاية الزوجين طبقا لأحكام هذه المدونة."
  },
  {
    "id": 5,
    "text": "المادة 5الخطبة تواعد رجل وامرأة على الزواج.تتحقق الخطبة بتعبير طرفيها بأي وسيلة متعارف عليها تفيد التواعد على الزواج، ويدخل في حكمها قراءة الفاتحة وما جرت به العادة والعرف من تبادل الهدايا."
  },
  {
    "id": 6,
    "text": "المادة 6يعتبر الطرفان في فترة خطبة إلى حين الإشهاد على عقد الزواج، ولكل من الطرفين حق العدول عنها."
  },
  {
    "id": 7,
    "text": "المادة 7مجرد العدول عن الخطبة لا يترتب عنه تعويض.غير أنه إذا صدر عن أحد الطرفين فعل سبب ضررا للآخر، يمكن للمتضرر المطالبة بالتعويض."
  },
  {
    "id": 8,
    "text": "المادة 8لكل من الخاطب والمخطوبة أن يسترد ما قدمه من هدايا، ما لم يكن العدول عن الخطبة من قبله.ترد الهدايا بعينها، أو بقيمتها حسب الأحوال."
  },
  {
    "id": 9,
    "text": "المادة 9إذا قدم الخاطب الصداق أو جزءا منه، وحدث عدول عن الخطبة أو مات أحد الطرفين أثناءها، فللخاطب أو لورثته استرداد ما سلم بعينه إن كان قائما، وإلا فمثله أو قيمته يوم تسلمه.إذا لم ترغب المخطوبة في أداء المبلغ الذي حول إلى جهاز، تحمل المتسبب في العدول ما قد ينتج عن ذلك من خسارة بين قيمة الجهاز والمبلغ المؤدى فيه."
  },
  {
    "id": 10,
    "text": "المادة 10ينعقد الزواج بإيجاب من أحد المتعاقدين وقبول من الآخر، بألفاظ تفيد معنى الزواج لغة أو عرفا.يصح الإيجاب والقبول من العاجز عن النطق بالكتابة إن كان يكتب، وإلا فبإشارته المفهومة من الطرف الآخر ومن الشاهدين."
  },
  {
    "id": 11,
    "text": "المادة 11يشترط في الإيجاب والقبول أن يكونا:1 - شفويين عند الاستطاعة، وإلا فبالكتابة أو الإشارة المفهومة؛2 - متطابقين وفي مجلس واحد؛3 - باتين غير مقيدين بأجل أو شرط واقف أو فاسخ."
  },
  {
    "id": 12,
    "text": "المادة 12تطبق على عقد الزواج المشوب بإكراه أو تدليس الأحكام المنصوص عليها في المادتين 63 و66 بعده."
  },
  {
    "id": 13,
    "text": "المادة 13يجب أن تتوفر في عقد الزواج الشروط الآتية:1 - أهلية الزوج والزوجة؛2 - عدم الاتفاق على إسقاط الصداق؛3 - ولي الزواج عند الاقتضاء؛4 - سماع العدلين التصريح بالإيجاب والقبول من الزوجين وتوثيقه؛5 - انتفاء الموانع الشرعية."
  },
  {
    "id": 14,
    "text": "المادة 14يمكن للمغاربة المقيمين في الخارج، أن يبرموا عقود زواجهم وفقا للإجراءات الإدارية المحلية لبلد إقامتهم، إذا توفر الإيجاب والقبول والأهلية والولي عند الاقتضاء، وانتفت الموانع ولم ينص على إسقاط الصداق، وحضره شاهدان مسلمان مع مراعاة أحكام المادة 21 بعده."
  },
  {
    "id": 15,
    "text": "المادة 15يجب على المغاربة الذين أبرموا عقد الزواج طبقا للقانون المحلي لبلد إقامتهم، أن يودعوا نسخة منه داخل أجل ثلاثة أشهر من تاريخ إبرامه بالمصالح القنصلية المغربية التابعة لها محل سكنى طالبة أو طالب التسجيل أو محل إبرام العقد.تسري أحكام الفقرة الأولى أعلاه أيضا على عقود الزواج المبرمة، من طرف المغاربة حسب القانون المحلي لبلدان الإقامة، قبل تاريخ نشر هذا القانون بالجريدة الرسمية.إذا لم توجد هذه المصالح ترسل النسخة داخل نفس الأجل إلى الوزارة المكلفة بالشؤون الخارجية.تتولى هذه الأخيرة إرسال النسخة المذكورة إلى ضابط الحالة المدنية وإلى قسم قضاء الأسرة لمحل ولادة كل من الزوجين.إذا لم يكن للزوجين أو لأحدهما محل ولادة بالمغرب، فإن النسخة توجه إلى قسم قضاء الأسرة بالرباط وإلى وكيل الملك بالمحكمة الابتدائية بالرباط."
  },
  {
    "id": 16,
    "text": "المادة 16تعتبر وثيقة عقد الزواج الوسيلة المقبولة لإثبات الزواج.إذا حالت أسباب قاهرة دون توثيق العقد في وقته تعتمد المحكمة في سماع دعوى الزوجية سائر وسائل الإثبات وكذا الخبرة.تأخذ المحكمة بعين الاعتبار وهي تنظر في دعوى الزوجية وجود أطفال أو حمل ناتج عن العلاقة الزوجية، وما إذا رفعت الدعوى في حياة الزوجين.يعمل بسماع دعوى الزوجية في فترة انتقالية لا تتعدى خمس عشرة سنة ابتداء من تاريخ دخول هذا القانون حيز التنفيذ."
  },
  {
    "id": 17,
    "text": "المادة 17يتم عقد الزواج بحضور أطرافه، غير أنه يمكن التوكيل على إبرامه، بإذن من قاضي الأسرة، المكلف بالزواج وفق الشروط الآتية:1 - وجود ظروف خاصة، لا يتأتى معها للموكل أن يقوم بإبرام عقد الزواج بنفسه؛2 - تحرير وكالة عقد الزواج في ورقة رسمية أو عرفية مصادق على توقيع الموكل فيها؛3 - أن يكون الوكيل راشدا متمتعا بكامل أهليته المدنية، وفي حالة توكيله من الولي يجب أن تتوفر فيه شروط الولاية؛4 - أن يعين الموكل في الوكالة اسم الزوج الآخر ومواصفاته، والمعلومات المتعلقة بهويته، وكل المعلومات التي يرى فائدة في ذكرها؛5 - أن تتضمن الوكالة قدر الصداق، وعند الاقتضاء المعجل منه والمؤجل. وللموكل أن يحدد الشروط التي يريد إدراجها في العقد والشروط التي يقبلها من الطرف الآخر؛6 - أن يؤشر القاضي المذكور على الوكالة بعد التأكد من توفرها على الشروط المطلوبة."
  },
  {
    "id": 18,
    "text": "المادة 18ليس للقاضي أن يتولى بنفسه تزويج من له الولاية عليه من نفسه ولا من أصوله ولا من فروعه."
  },
  {
    "id": 19,
    "text": "المادة 19تكتمل أهلية الزواج بإتمام الفتى والفتاة المتمتعين بقواهما العقلية ثمان عشرة سنة شمسية."
  },
  {
    "id": 20,
    "text": "المادة 20لقاضي الأسرة المكلف بالزواج، أن يأذن بزواج الفتى والفتاة دون سن الأهلية المنصوص عليه في المادة 19 أعلاه، بمقرر معلل يبين فيه المصلحة والأسباب المبررة لذلك، بعد الاستماع لأبوي القاصر أو نائبه الشرعي والاستعانة بخبرة طبية أو إجراء بحث اجتماعي.مقرر الاستجابة لطلب الإذن بزواج القاصر غير قابل لأي طعن."
  },
  {
    "id": 21,
    "text": "المادة 21زواج القاصر متوقف على موافقة نائبه الشرعي.تتم موافقة النائب الشرعي بتوقيعه مع القاصر على طلب الإذن بالزواج وحضوره إبرام العقد.إذا امتنع النائب الشرعي للقاصر عن الموافقة بت قاضي الأسرة المكلف بالزواج في الموضوع."
  },
  {
    "id": 22,
    "text": "المادة 22يكتسب المتزوجان طبقا للمادة 20 أعلاه، الأهلية المدنية في ممارسة حق التقاضي في كل ما يتعلق بآثار عقد الزواج من حقوق والتزامات.يمكن للمحكمة بطلب من أحد الزوجين أو نائبه الشرعي، أن تحدد التكاليف المالية للزوج المعني وطريقة أدائها."
  },
  {
    "id": 23,
    "text": "المادة 23يأذن قاضي الأسرة المكلف بالزواج بزواج الشخص المصاب بإعاقة ذهنية ذكرا كان أم أنثى، بعد تقديم تقرير حول حالة الإعاقة من طرف طبيب خبير أو أكثر.يطلع القاضي الطرف الآخر على التقرير وينص على ذلك في محضر.يجب أن يكون الطرف الآخر راشدا ويرضى صراحة في تعهد رسمي بعقد الزواج مع المصاب بالإعاقة."
  },
  {
    "id": 24,
    "text": "المادة 24الولاية حق للمرأة تمارسه الراشدة حسب اختيارها ومصلحتها."
  },
  {
    "id": 25,
    "text": "المادة 25للراشدة أن تعقد زواجها بنفسها، أو تفوض ذلك لأبيها أو لأحد أقاربها."
  },
  {
    "id": 26,
    "text": "المادة 26الصداق هو ما يقدمه الزوج لزوجته إشعارا بالرغبة في عقد الزواج وإنشاء أسرة مستقرة، وتثبيت أسس المودة والعشرة بين الزوجين، وأساسه الشرعي هو قيمته المعنوية والرمزية، وليس قيمته المادية."
  },
  {
    "id": 27,
    "text": "المادة 27يحدد الصداق وقت إبرام العقد، وفي حالة السكوت عن تحديده، يعتبر العقد زواج تفويض.إذا لم يتراض الزوجان بعد البناء على قدر الصداق في زواج التفويض، فإن المحكمة تحدده مراعية الوسط الاجتماعي للزوجين."
  },
  {
    "id": 28,
    "text": "المادة 28كل ما صح التزامه شرعا، صلح أن يكون صداقا، والمطلوب شرعا تخفيف الصداق."
  },
  {
    "id": 29,
    "text": "المادة 29الصداق ملك للمرأة تتصرف فيه كيف شاءت، ولا حق للزوج في أن يطالبها بأثاث أو غيره، مقابل الصداق الذي أصدقها إياه."
  },
  {
    "id": 30,
    "text": "المادة 30يجوز الاتفاق على تعجيل الصداق أو تأجيله إلى أجل مسمى كلا أو بعضا."
  },
  {
    "id": 31,
    "text": "المادة 31يؤدى الصداق عند حلول الأجل المتفق عليه.للزوجة المطالبة بأداء الحال من الصداق قبل بداية المعاشرة الزوجية.إذا وقعت المعاشرة الزوجية قبل الأداء، أصبح الصداق دينا في ذمة الزوج."
  },
  {
    "id": 32,
    "text": "المادة 32تستحق الزوجة الصداق كله بالبناء أو الموت قبله.تستحق الزوجة نصف الصداق المسمى إذا وقع الطلاق قبل البناء.لا تستحق الزوجة الصداق قبل البناء:1 - إذا وقع فسخ عقد الزواج؛2 - إذا وقع رد عقد الزواج بسبب عيب في الزوجة، أو كان الرد من الزوجة بسبب عيب في الزوج؛3 - إذا حدث الطلاق في زواج التفويض."
  },
  {
    "id": 33,
    "text": "المادة 33إذا اختلف في قبض حال الصداق قبل البناء، فالقول قول الزوجة، أما بعده فالقول قول الزوج.إذا اختلف الزوجان في قبض الصداق المؤجل، فعلى الزوج إثبات أدائه.لا يخضع الصداق لأي تقادم."
  },
  {
    "id": 34,
    "text": "المادة 34كل ما أتت به الزوجة من جهاز وشوار يعتبر ملكا لها.إذا وقع نزاع في باقي الأمتعة، فالفصل فيه يخضع للقواعد العامة للإثبات.غير أنه إذا لم يكن لدى أي منهما بينة، فالقول للزوج بيمينه في المعتاد للرجال، وللزوجة بيمينها في المعتاد للنساء. أما المعتاد للرجال والنساء معا فيحلف كل منهما ويقتسمانه ما لم يرفض أحدهما اليمين ويحلف الآخر فيحكم له."
  },
  {
    "id": 35,
    "text": "المادة 35موانع الزواج قسمان: مؤبدة ومؤقتة."
  },
  {
    "id": 36,
    "text": "المادة 36المحرمات بالقرابة أصول الرجل وفصوله وفصول أول أصوله وأول فصل من كل أصل وإن علا."
  },
  {
    "id": 37,
    "text": "المادة 37المحرمات بالمصاهرة أصول الزوجات بمجرد العقد وفصولهن بشرط البناء بالأم، وزوجات الآباء وإن علوا، وزوجات الأولاد وإن سفلوا بمجرد العقد."
  },
  {
    "id": 38,
    "text": "المادة 38يحرم من الرضاع ما يحرم من النسب والمصاهرة.يعد الطفل الرضيع خاصة، دون إخوته وأخواته ولدا للمرضعة وزوجها.لا يمنع الرضاع من الزواج، إلا إذا حصل داخل الحولين الأولين قبل الفطام."
  },
  {
    "id": 39,
    "text": "المادة 39موانع الزواج المؤقتة هي:1 - الجمع بين أختين، أو بين امرأة وعمتها أو خالتها من نسب أو رضاع؛2 - الزيادة في الزوجات على العدد المسموح به شرعا؛3 - حدوث الطلاق بين الزوجين ثلاث مرات، إلى أن تنقضي عدة المرأة من زوج آخر دخل بها دخولا يعتد به شرعا؛زواج المطلقة من آخر يبطل الثلاث السابقة، فإذا عادت إلى مطلقها يملك عليها ثلاثا جديدة؛4 - زواج المسلمة بغير المسلم، والمسلم بغير المسلمة ما لم تكن كتابية؛5 - وجود المرأة في علاقة زواج أو في عدة أو استبراء."
  },
  {
    "id": 40,
    "text": "المادة 40يمنع التعدد إذا خيف عدم العدل بين الزوجات، كما يمنع في حالة وجود شرط من الزوجة بعدم التزوج عليها."
  },
  {
    "id": 41,
    "text": "المادة 41لا تأذن المحكمة بالتعدد:- إذا لم يثبت لها المبرر الموضوعي الاستثنائي؛- إذا لم تكن لطالبه الموارد الكافية لإعالة الأسرتين، وضمان جميع الحقوق من نفقة وإسكان ومساواة في جميع أوجه الحياة."
  },
  {
    "id": 42,
    "text": "المادة 42في حالة عدم وجود شرط الامتناع عن التعدد، يقدم الراغب فيه طلب الإذن بذلك إلى المحكمة.يجب أن يتضمن الطلب بيان الأسباب الموضوعية الاستثنائية المبررة له، وأن يكون مرفقا بإقرار عن وضعيته المادية."
  },
  {
    "id": 43,
    "text": "المادة 43تستدعي المحكمة الزوجة المراد التزوج عليها للحضور. فإذا توصلت شخصيا ولم تحضر أو امتنعت من تسلم الاستدعاء، توجه إليها المحكمة عن طريق عون كتابة الضبط إنذارا تشعرها فيه بأنها إذا لم تحضر في الجلسة المحدد تاريخها في الإنذار فسيبت في طلب الزوج في غيابها.كما يمكن البت في الطلب في غيبة الزوجة المراد التزوج عليها إذا أفادت النيابة العامة تعذر الحصول على موطن أو محل إقامة يمكن استدعاؤها فيه.إذا كان سبب عدم توصل الزوجة بالاستدعاء ناتجا عن تقديم الزوج بسوء نية لعنوان غير صحيح أو تحريف في اسم الزوجة تطبق على الزوج العقوبة المنصوص عليها في الفصل 361 من القانون الجنائي بطلب من الزوجة المتضررة."
  },
  {
    "id": 44,
    "text": "المادة 44تجري المناقشة في غرفة المشورة بحضور الطرفين. ويستمع إليهما لمحاولة التوفيق والإصلاح، بعد استقصاء الوقائع وتقديم البيانات المطلوبة.للمحكمة أن تأذن بالتعدد بمقرر معلل غير قابل لأي طعن، إذا ثبت لها مبرره الموضوعي الاستثنائي، وتوفرت شروطه الشرعية، مع تقييده بشروط لفائدة المتزوج عليها وأطفالهما."
  },
  {
    "id": 45,
    "text": "المادة 45إذا ثبت للمحكمة من خلال المناقشات تعذر استمرار العلاقة الزوجية، وأصرت الزوجة المراد التزوج عليها على المطالبة بالتطليق، حددت المحكمة مبلغا لاستيفاء كافة حقوق الزوجة وأولادهما الملزم الزوج بالإنفاق عليهم.يجب على الزوج إيداع المبلغ المحدد داخل أجل لا يتعدى سبعة أيام.تصدر المحكمة بمجرد الإيداع حكما بالتطليق ويكون هذا الحكم غير قابل لأي طعن في جزئه القاضي بإنهاء العلاقة الزوجية.يعتبر عدم إيداع المبلغ المذكور داخل الأجل المحدد تراجعا عن طلب الإذن بالتعدد.فإذا تمسك الزوج بطلب الإذن بالتعدد، ولم توافق الزوجة المراد التزوج عليها، ولم تطلب التطليق طبقت المحكمة تلقائيا مسطرة الشقاق المنصوص عليها في المواد 94 إلى 97 بعده."
  },
  {
    "id": 46,
    "text": "المادة 46في حالة الإذن بالتعدد لا يتم العقد مع المراد التزوج بها إلا بعد إشعارها من طرف القاضي بأن مريد الزواج بها متزوج بغيرها ورضاها بذلك.يضمن هذا الإشعار والتعبير عن الرضى في محضر رسمي."
  },
  {
    "id": 47,
    "text": "المادة 47الشروط كلها ملزمة، إلا ما خالف منها أحكام العقد ومقاصده وما خالف القواعد الآمرة للقانون فيعتبر باطلا والعقد صحيحا."
  },
  {
    "id": 48,
    "text": "المادة 48الشروط التي تحقق فائدة مشروعة لمشترطها تكون صحيحة وملزمة لمن التزم بها من الزوجين.إذا طرأت ظروف أو وقائع أصبح معها التنفيذ العيني للشرط مرهقا، أمكن للملتزم به أن يطلب من المحكمة إعفاءه منه أو تعديله ما دامت تلك الظروف أو الوقائع قائمة، مع مراعاة أحكام المادة 40 أعلاه."
  },
  {
    "id": 49,
    "text": "المادة 49لكل واحد من الزوجين ذمة مالية مستقلة عن ذمة الآخر، غير أنه يجوز لهما في إطار تدبير الأموال التي ستكتسب أثناء قيام الزوجية الاتفاق على استثمارها وتوزيعها.يضمن هذا الاتفاق في وثيقة مستقلة عن عقد الزواج.يقوم العدلان بإشعار الطرفين عند زواجهما بالأحكام السالفة الذكر.إذا لم يكن هناك اتفاق فيرجع للقواعد العامة للإثبات، مع مراعاة عمل كل واحد من الزوجين وما قدمه من مجهودات وما تحمله من أعباء لتنمية أموال الأسرة."
  },
  {
    "id": 50,
    "text": "المادة 50إذا توفرت في عقد الزواج أركانه وشروط صحته وانتفت الموانع، فيعتبر صحيحا وينتج جميع آثاره من الحقوق والواجبات التي رتبتها الشريعة بين الزوجين والأبناء والأقارب، المنصوص عليها في هذه المدونة."
  },






  {
    "id": 1,
    "text": "الفصل 1\nيحدد التشريع الجنائي أفعال الإنسان التي يعتبرها جرائم، بسبب ما تحدثه من اضطراب اجتماعي، ويوجب زجر مرتكبيها بعقوبات أو تدابير وقائية."
  },
  {
    "id": 2,
    "text": "الفصل 2\nلا يسوغ لأحد أن يعتذر بجهل التشريع الجنائي."
  },
  {
    "id": 3,
    "text": "الفصل 3\nلا يسوغ مؤاخذة أحد على فعل لا يعد جريمة بصريح القانون ولا معاقبته بعقوبات لم يقررها القانون."
  },
  {
    "id": 4,
    "text": "الفصل 4\nلا يؤاخذ أحد على فعل لم يكن جريمة بمقتضى القانون الذي كان ساريا وقت ارتكابه."
  },
  {
    "id": 5,
    "text": "الفصل 5\nإذا وجد بعد الحكم البات أن التشريع المعمول به يوم ارتكاب الجريمة هو الأصلح للمتهم، طبقت مقتضياته دون غيرها."
  },
  {
    "id": 6,
    "text": "الفصل 6\nفي حالة وجود عدة قوانين سارية المفعول، بين تاريخ ارتكاب الجريمة والحكم النهائي بشأنها، يتعين تطبيق القانون الأصلح للمتهم."
  },
  {
    "id": 7,
    "text": "الفصل 7\nلا تشمل مقتضيات الفصلين 5 و6 القوانين المؤقتة التي تظل، ولو بعد انتهاء العمل بها، سارية على الجرائم المرتكبة خلال مدة تطبيقها."
  },
  {
    "id": 8,
    "text": "الفصل 8\nلا يمكن أن يقع تنفيذ التدابير الوقائية إلا طبقا لمقتضيات القانون النافذ وقت صدور الحكم."
  },
  {
    "id": 9,
    "text": "الفصل 9\nينتهي تنفيذ التدبير الوقائي إذا صدر قانون جديد يزيل عن الفعل صفة الجريمة."
  },
  {
    "id": 10,
    "text": "الفصل 10\nيسري التشريع الجنائي المغربي على كل من يوجد بإقليم المملكة من وطنيين وأجانب وعديمي الجنسية، مع مراعاة الاستثناءات المقررة في القانون العام الداخلي والقانون الدولي."
  },
  {
    "id": 11,
    "text": "الفصل 11\nيدخل ضمن إقليم المملكة، السفن والطائرات المغربية أينما وجدت، فيما عدا الحالات التي تكون فيها خاضعة لتشريع أجنبي بمقتضى القانون الدولي."
  },
  {
    "id": 12,
    "text": "الفصل 12\nيطبق التشريع الجنائي المغربي على الجرائم المرتكبة خارج المملكة، إذا كانت من اختصاص المحاكم الزجرية المغربية حسب فصول المسطرة الجنائية المتعلقة بذلك."
  },
  {
    "id": 13,
    "text": "الكتاب الأول\nفي العقوبات والتدابير الوقائية\nالجزء الأول\nفي العقوبات\nالباب الأول\nفي العقوبات بوجه عام\nالفصل 13\nالعقوبة إما أصلية أو إضافية."
  },
  {
    "id": 14,
    "text": "الفصل 14\nالعقوبات الأصلية إما جنائية أو جنحية أو متعلقة بالمخالفات."
  },
  {
    "id": 15,
    "text": "الفصل 15\nالعقوبات الجنائية الأصلية هي:\n1 - الإعدام؛\n2 - السجن المؤبد؛\n3 - السجن المؤقت من خمس سنوات إلى ثلاثين سنة؛\n4 - الإقامة الإجبارية؛\n5 - التجريد من الحقوق الوطنية."
  },
  {
    "id": 16,
    "text": "الفصل 16\nالعقوبات الجنحية الأصلية هي:\n1 - الحبس؛\n2 - الغرامة التي تتجاوز 1200 درهم.\nوأقل مدة الحبس شهر وأقصاها خمس سنوات باستثناء حالات العود أو غيرها التي يحدد فيها القانون مددا أخرى."
  },
  {
    "id": 17,
    "text": "الفصل 17\nالعقوبة المتعلقة بالمخالفات هي:\n1 - الاعتقال لمدة تقل عن شهر؛\n2 - الغرامة من 30 إلى 1200 درهم."
  },
  {
    "id": 18,
    "text": "الفصل 18\n(تمم - بالفقرة الثانية - بمقتضى الظهير الشريف رقم 284-66-1 بتاريخ 14 ربيع الأول 1387 (22 يونيو 1967) - الجريدة الرسمية عدد 2852 بتاريخ 20 ربيع الأول 1387 (28 يونيو 1967) ص 1311).\nتنفذ عقوبة الإعدام رميا بالرصاص، ويتم التنفيذ في مكان تعينه وزارة العدل.\nولا يمكن أن يقع التنفيذ يوم عيد وطني أو ديني.\nولا يمكن تنفيذ عقوبة الإعدام على المرأة الحامل إلا بعد مضي سنتين على وضع حملها."
  },
  {
    "id": 19,
    "text": "الفصل 19\nإذا حكم على رجل وزوجته، ولو عن جرائم مختلفة، بالحبس لمدة تقل عن سنة، وكانا غير معتقلين يوم صدور الحكم، فإنهما لا ينفذان عقوبتهما في آن واحد إن هما أثبتا أن لهما محل إقامة معينا وأن في كفالتهما وتحت رعايتهما طفلا دون الثامنة عشرة، وأن أحدهما يتكفل بحضانته.\nويسري نفس الحكم على الأم والأب غير المتزوجين إذا ثبتت بنوة الطفل منهما معا."
  },
  {
    "id": 20,
    "text": "الفصل 20\nإذا كان الزوجان، أو الأب والأم، المحكوم عليهما على النحو المبين في الفصل السابق، معتقلين في يوم صدور الحكم، فإنه يجوز لوكيل الملك، بالنسبة للمحكوم عليهما من طرف المحاكم العادية، وللوكيل العام للملك بالنسبة للمحكوم عليهما من طرف المحاكم العسكرية، أن يؤخر تنفيذ العقوبة الصادرة على أحدهما إلى أن يفرج عن الآخر."
  },
  {
    "id": 21,
    "text": "الفصل 21\nإذا كانت العقوبة الصادرة على أحد الزوجين أو أحد الأبوين هي الحبس لمدة تتجاوز سنة، فإنه يمكن، في الحالة المنصوص عليها في الفصل 19، تأخير تنفيذها على أحدهما حتى يفرج عن الآخر، على ألا يتجاوز هذا التأخير سنة واحدة."
  },
  {
    "id": 22,
    "text": "الفصل 22\nلا تطبق مقتضيات الفصول الثلاثة السابقة على المحكوم عليهم لارتكابهم جريمة من الجرائم الماسة بأمن الدولة."
  },
  {
    "id": 23,
    "text": "الفصل 23\nتنفذ عقوبة الإقامة الإجبارية في مكان معين بقرار من وزير العدل."
  },
  {
    "id": 24,
    "text": "الفصل 24\nعقوبة الإقامة الإجبارية تلزم المحكوم عليه بأن يقيم في المكان المعين له، مع منحه رخصة للتغيب المؤقت إن كان لذلك محل."
  },
  {
    "id": 25,
    "text": "الفصل 25\nالتجريد من الحقوق الوطنية يتضمن:\n1 - العزل من جميع الوظائف العمومية وكل الخدمات والأعمال العمومية.\n2 - الحرمان من أن يكون ناخبا أو منتخبا، ومن سائر الحقوق الوطنية والسياسية، ومن حق التحلي بأي وسام.\n3 - عدم الأهلية للقيام بمهمة عضو محلف أو خبير، وعدم الأهلية لأداء الشهادة أمام القضاء إلا على سبيل الإخبار فقط.\n4 - عدم الأهلية لأن يكون وصيا أو مشرفا على غير أولاده.\n5 - الحرمان من حق حمل السلاح ومن الخدمة في الجيش والقيام بالتعليم أو إدارة مدرسة أو العمل في مؤسسة للتعليم كأستاذ أو مدرس أو مراقب.\nوالتجريد من الحقوق الوطنية، عندما يكون عقوبة أصلية، يحكم به لمدى الحياة.\nأما عندما يكون هذا التجريد نتيجة لعقوبة جنائية، فإنه يبتدئ من يوم انقضاء العقوبة الأصلية وينتهي بعد مضي المدة التي يحددها حكم الإدانة على ألا تقل عن خمس سنوات ولا تتجاوز عشرين سنة."
  },
  {
    "id": 26,
    "text": "الفصل 26\nكل محكوم عليه بعقوبة جنائية يكون، بحكم القانون، في حالة حجر قانوني.\nويترتب على الحجر القانوني حرمان المحكوم عليه من مباشرة حقوقه المالية طوال مدة تنفيذ العقوبة الأصلية.\nويمارس حقوقه بواسطة وصي تعينه المحكمة طبقا لمقتضيات قانون المسطرة المدنية، مع مراعاة المقتضيات الخاصة المنصوص عليها في قانون التجارة."
  },
  {
    "id": 27,
    "text": "الفصل 27\nلا يمكن أن تكون مدة العقوبة بالسجن المؤقت أقل من خمس سنوات ولا أكثر من ثلاثين سنة."
  },
  {
    "id": 28,
    "text": "الفصل 28\nمدة الحبس لا يمكن أن تقل عن شهر ولا أن تتجاوز خمس سنوات، ما لم ينص القانون على خلاف ذلك."
  },
  {
    "id": 29,
    "text": "الفصل 29\nمدة الاعتقال لا يمكن أن تقل عن يوم واحد ولا أن تتجاوز شهرا واحدا."
  },
  {
    "id": 30,
    "text": "الفصل 30\nاليوم في حساب مدد العقوبات السالبة للحرية أربع وعشرون ساعة.\nوالشهر ثلاثون يوما."
  },
  {
    "id": 31,
    "text": "الفصل 31\nإذا لم تكن مدة العقوبة السالبة للحرية معينة في النص، فإنها تكون:\n1 - في الجنايات، السجن من خمس إلى عشرين سنة؛\n2 - في الجنح، الحبس من شهر إلى سنتين؛\n3 - في المخالفات، الاعتقال من يوم إلى خمسة عشر يوما."
  },
  {
    "id": 32,
    "text": "الفصل 32\n(غير وتمم بمقتضى القانون رقم 08-03 الصادر بتنفيذه الظهير الشريف رقم 194-03-1 بتاريخ 14 رجب 1424 (11 شتنبر 2003) - الجريدة الرسمية عدد 5171 بتاريخ 27 ذي القعدة 1424 (20 يناير 2004) ص 343).\nيجوز الحكم بالعقوبات الإضافية الآتية:\n1 - الحجر القانوني؛\n2 - التجريد من الحقوق الوطنية؛\n3 - الحرمان المؤقت من ممارسة بعض الحقوق الوطنية أو المدنية أو العائلية؛\n4 - الحرمان النهائي أو المؤقت من الحق في المعاشات التي تصرفها الدولة والمؤسسات العمومية؛\n5 - المصادرة الجزئية للأشياء المملوكة للمحكوم عليه، مع حفظ حقوق الغير؛\n6 - حل الشخص المعنوي؛\n7 - نشر الحكم الصادر بالإدانة."
  },
  {
    "id": 33,
    "text": "الفصل 33\nالحرمان المؤقت من ممارسة حق أو عدة حقوق وطنية أو مدنية أو عائلية لا يمكن أن يقل عن سنة ولا أن يتجاوز عشر سنوات، ما لم ينص القانون على خلاف ذلك.\nوهذا الحرمان يشمل واحدا أو أكثر من الحقوق الآتية:\n1 - الحقوق المنصوص عليها في الفقرات من 1 إلى 5 من الفصل 25؛\n2 - حق المشاركة في أية مناقصة أو مزايدة عمومية؛\n3 - حق حمل السلاح؛\n4 - حق التصويت والترشيح في الانتخابات."
  },
  {
    "id": 34,
    "text": "الفصل 34\nيجوز للمحكمة، في الحالات التي يحددها القانون، أن تأمر بحرمان المحكوم عليه من الحق في مزاولة مهنة أو نشاط أو فن، إذا ثبت أن الجريمة المرتكبة لها علاقة مباشرة بمزاولة المهنة أو النشاط أو الفن، وأن استمرار المحكوم عليه في مزاولة ذلك يمثل خطرا على الأمن العام أو على الغير.\nوهذا الحرمان يمكن أن يكون نهائيا أو مؤقتا لمدة لا تتجاوز عشر سنوات."
  },
  {
    "id": 35,
    "text": "الفصل 35\nيجوز للمحكمة، في الحالات التي يحددها القانون، أن تأمر بإغلاق محل تجاري أو صناعي بصفة نهائية أو مؤقتة لمدة لا تتجاوز ستة أشهر.\nويجوز للمحكمة أن تأمر بنشر ملخص الحكم القاضي بالإغلاق في جريدتين أو أكثر على نفقة المحكوم عليه."
  },
  {
    "id": 36,
    "text": "الفصل 36\nالمصادرة هي تمليك الدولة جزءا من أملاك المحكوم عليه أو بعض أملاك له معينة.\nوفي حالة عدم التنصيص الصريح في القانون، فإن المصادرة لا تطبق إلا في الجنايات.\nولا يمكن أن تطال المصادرة إلا الأشياء التي استعملت في ارتكاب الجريمة أو التي تحصلت منها، ما لم ينص القانون على خلاف ذلك."
  },
  {
    "id": 37,
    "text": "الفصل 37\nيجوز للمحكمة أن تأمر بمصادرة الأشياء التي يشكل صنعها أو استعمالها أو حيازتها أو بيعها أو عرضها للبيع جريمة."
  },
  {
    "id": 38,
    "text": "الفصل 38\nإذا صدر حكم بالمصادرة، فإن المحكمة تبت في شأن الأشياء المصادرة، وتعين لفائدة من تكون، وكيفية التصرف فيها، مع حفظ حقوق الغير."
  },
  {
    "id": 39,
    "text": "الفصل 39\nفي حالة الحكم بعقوبة سالبة للحرية، إذا لم يكن للمحكوم عليه أموال كافية لأداء المصاريف القضائية، فإن المحكمة تقرر الإكراه البدني كوسيلة لإجباره على الأداء.\nويحدد الحكم مدة الإكراه البدني، مع مراعاة المقتضيات المنصوص عليها في قانون المسطرة الجنائية."
  },
  {
    "id": 40,
    "text": "الفصل 40\nيجب الحكم بالرد في جميع الجرائم.\nوالرد هو إعادة الأشياء أو المبالغ أو الأمتعة المنقولة المملوكة للغير، والتي بقيت في حوزة المحكوم عليه، إلى أصحابها."
  },
  {
    "id": 41,
    "text": "الفصل 41\nيجوز للمحكمة أن تأمر بنشر الحكم الصادر بالإدانة، كاملا أو ملخصا منه، في جريدة أو عدة جرائد تعينها، على نفقة المحكوم عليه."
  },
  {
    "id": 42,
    "text": "الفصل 42\nإذا صدر حكم بالإدانة من أجل جريمة من الجرائم الماسة بالشرف أو الاعتبار، فإنه يجوز للمحكمة أن تأمر بنشر الحكم في جريدة أو أكثر على نفقة المحكوم عليه."
  },
  {
    "id": 43,
    "text": "الفصل 43\nيجوز للمحكمة، في حالة الحكم من أجل جريمة من الجرائم المنصوص عليها في الفصول 527 إلى 539، أن تأمر بتعليق الحكم في الأماكن التي تعينها، وبنشره في جريدة أو أكثر، وذلك على نفقة المحكوم عليه، على ألا تتجاوز مدة التعليق شهرا واحدا."
  },
  {
    "id": 44,
    "text": "الفصل 44\nيجوز الحكم بحل الشخص المعنوي في الحالات التي ينص عليها القانون.\nويترتب على حل الشخص المعنوي تصفية أمواله، مع حفظ حقوق الغير."
  },
  {
    "id": 45,
    "text": "الفصل 45\nالعقوبات الإضافية لا تنفذ إلا إذا نص عليها الحكم الصادر بالإدانة صراحة، ما لم ينص القانون على خلاف ذلك."
  },
  {
    "id": 46,
    "text": "الفصل 46\nإذا لم تكن العقوبة الإضافية معينة في النص، فإن المحكمة تحدد مدتها وشروط تطبيقها."
  },
  {
    "id": 47,
    "text": "الفصل 47\nيجوز للمحكمة أن تأمر بوقف تنفيذ العقوبة الإضافية، إذا كانت قابلة لذلك."
  },
  {
    "id": 48,
    "text": "الفصل 48\nيجوز للمحكمة، في حالة الحكم بعقوبة الحبس، أن تأمر بوقف التنفيذ إذا توفرت الشروط الآتية:\n1 - ألا يكون المحكوم عليه قد سبق الحكم عليه بالحبس من أجل جناية أو جنحة؛\n2 - أن تأمر المحكمة بذلك في نفس الحكم الصادر بالعقوبة."
  },
  {
    "id": 49,
    "text": "الفصل 49\nإذا صدر أمر بوقف التنفيذ، فإن العقوبة لا تنفذ إلا إذا ارتكب المحكوم عليه، خلال مدة خمس سنوات من تاريخ الحكم الذي أصبح نهائيا، جناية أو جنحة حكم عليه من أجلها بالحبس.\nوفي هذه الحالة، تنفذ العقوبة الأولى قبل العقوبة الثانية، دون أن يقع بينهما خلط أو إدماج."
  },
  {
    "id": 50,
    "text": "الفصل 50\nإذا انقضت مدة خمس سنوات من تاريخ الحكم الذي أصبح نهائيا، دون أن يرتكب المحكوم عليه جناية أو جنحة حكم عليه من أجلها بالحبس، فإن الحكم الأول يعتبر كأن لم يكن."
  }
]